/*
6.Задача с интервью*
У вас есть массив со скобками, предположим 
[ ‘(‘, ‘)’, ‘(‘, ‘)’, ‘)’] количество элементов и последовательность может быть разной.
Нужно выяснить, у каждой ли скобки есть соответствующая пара (открывающая и закрывающая).
*/
/*
let arr = ['(', '(', ')', ')', '(', '(']
let a = 0 
let b = 0
for(let i = 0; i < arr.length; i++){
 
   if(arr[i] == '('){
       a++             //увеличит а на колво раз, сколько увидит ее               
   }
   if(arr[i] == ')'){
       b++                 
    }
} 
console.log(`количество '(' = ${a}`) 
console.log(`количество ')' = ${b}`)  

if(a == b){
    console.log("скобки закрыты")   
} else
 {console.log("скобки не закрыты") }

// ================================ вариант 2 - подходит, если '(' и ')' должны следовать др. за другом
console.log('********************************************************')

let arr2 = [ "(",")","(",")",")","(",")","(",")",")","(",")"]
let sum = 0

for(i = 0; i < arr2.length; i++){
if (arr2[i] == "(" && arr2[++i] == ")" ){
    sum = sum + 1
   
       console.log(sum + " скобки закрыты")

} else {
       console.log( sum + 1 + " скобки не закрыты" )}
}
*/